webserver/app/controllers/books_controller.rb

  def index
    @book = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(:user_ip => params[:user_ip], :port_number => params[:port_number], :title => params[:title], :isbn => params[:isbn], :author => params[:author], :location => params[:location])
    if @book.save
---
INSERT INTO "books" ("user_ip", "port_number", "title", "isbn", "author", "location") VALUES (?, ?, ?, ?, ?, ?)  [["user_ip", "0.0.0.0/0.0.0.0"], ["port_number", "1111"], ["title", "EV"], ["isbn", ""], ["author", "dd"], ["location", "/Users/danieldao/Downloads/Evaluation form-3.docx"]]

  def search
    books = Book.where(:title => params[:search_term])
    if !(books.blank?)
      puts "found books by title"
      puts books
      render json: books, status: 200
    else
        books = Book.where(:author => params[:search_term])
        if !(books.blank?)
        puts "found books by author"
        puts books
        render json: books, status: 200
        else
          books = Book.where(:isbn => params[:search_term])
---
SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", ""]]
SELECT "books".* FROM "books" WHERE "books"."author" = ?  [["author", "a"]]
SELECT "books".* FROM "books" WHERE "books"."isbn" = ?  [["isbn", "a"]]