v1-napster/webserver/app/controllers/books_controller.rb

  def clear
    puts "delete book: " + params[:user_ip] + ": " + params[:port_number]
    Book.where(user_ip: params[:user_ip], port_number: params[:port_number]).delete_all
---
DELETE FROM "books" WHERE "books"."user_ip" = ? AND "books"."port_number" = ?  [["user_ip", "0.0.0.0/0.0.0.0"], ["port_number", "1111"]]