v1-napster/webserver/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_ip" = ?  [["user_ip", "10.0.1.6"]]
---
  def unshareBook
    puts "unshare books from user ip: " + params[:user_ip]
    books = Book.where(:user_ip => params[:user_ip])