v1-napster/webserver/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.all

INSERT INTO "books" ("user_client_ip", "user_ip", "port_number", "title", "author", "isbn", "location") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_client_ip", "10.0.1.6"], ["user_ip", "localhost/127.0.0.1"], ["port_number", "1111"], ["title", "jb"], ["author", "dd"], ["isbn", ""], ["location", "/Users/danieldao/Downloads/jb.ttc"]]
---
  def create
    user_client_ip = request.remote_ip
    puts "client user ip: " + user_client_ip
    @book = Book.new(:user_client_ip => user_client_ip, :user_ip => params[:user_ip], :port_number => params[:port_number], :title => params[:title], :isbn => params[:isbn], :author => params[:author], :location => params[:location])
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."user_client_ip" = ? AND "books"."user_ip" = ? AND "books"."port_number" = ?  [["user_client_ip", "10.0.1.6"], ["user_ip", "localhost/127.0.0.1"], ["port_number", "1111"]]
SELECT "books".* FROM "books" WHERE "books"."user_ip" = ? AND "books"."port_number" = ?  [["user_ip", "10.0.1.6"], ["port_number", "1111"]]
---
  def getAllMyBooks
    user_client_ip = request.remote_ip
    books = Book.where(:user_client_ip => user_client_ip, :user_ip => params[:user_ip], :port_number => params[:port_number])
    if !(books.blank?)

SELECT "books".* FROM "books" WHERE "books"."user_client_ip" = ?  [["user_client_ip", "10.0.1.6"]]
UPDATE "books" SET "isShared" = ? WHERE "books"."id" = ?  [["isShared", "f"], ["id", 1]]
---
  def unshareBook
    user_client_ip = request.remote_ip
    puts "unshare books from user ip: " + user_client_ip
    books = Book.where(:user_client_ip => user_client_ip)
    for book in books
      puts "unsharing book: " + book.title
      book.isShared = false
      book.save

SELECT "books".* FROM "books" WHERE "books"."user_client_ip" = ? AND "books"."user_ip" = ? AND "books"."port_number" = ? AND "books"."title" = ? AND "books"."author" = ?  [["user_client_ip", "10.0.1.6"], ["user_ip", "0.0.0.0/0.0.0.0"], ["port_number", "1111"], ["title", "jb"], ["author", "dd"]]
SELECT "books".* FROM "books" WHERE "books"."user_ip" = ? AND "books"."port_number" = ? AND "books"."title" = ? AND "books"."author" = ?  [["user_ip", "10.0.1.159"], ["port_number", "1111"], ["title", "skip graphs"], ["author", "james aspnes, gauri shah"]]
UPDATE "books" SET "location" = ?, "isShared" = ? WHERE "books"."id" = ?  [["location", "/Users/danieldao/Downloads/jb1.ttc"], ["isShared", "t"], ["id", 1]]
---
  def updateLocation
    user_client_ip = request.remote_ip
    books = Book.where(:user_client_ip => user_client_ip, :user_ip => params[:user_ip], :port_number => params[:port_number], :title => params[:title], :author => params[:author])

    if books.blank?
      render json: books, status: 204
    else
      book = books[0]
      book.location = params[:location]
      book.isShared = true
      if book.save

SELECT "books".* FROM "books" WHERE "books"."user_client_ip" = ? AND "books"."user_ip" = ? AND "books"."port_number" = ? AND "books"."location" = ?  [["user_client_ip", "10.0.1.6"], ["user_ip", "localhost/127.0.0.1"], ["port_number", "1111"], ["location", "/Users/danieldao/Downloads/jb.ttc"]]
SELECT "books".* FROM "books" WHERE "books"."user_ip" = ? AND "books"."port_number" = ? AND "books"."location" = ?  [["user_ip", "10.0.1.6"], ["port_number", "1111"], ["location", "/Users/danieldao/Downloads/jb.ttc"]]
UPDATE "books" SET "isShared" = ? WHERE "books"."id" = ?  [["isShared", "t"], ["id", 1]]
---
  def updateSharingStatus
    user_client_ip = request.remote_ip
    books = Book.where(:user_client_ip => user_client_ip, :user_ip => params[:user_ip], :port_number => params[:port_number], :location => params[:location])

    if books.blank?
      render json: books, status: 204
    else
      book = books[0]
      if params[:sharing_status] == "true"
        book.isShared = true
      else
        book.isShared = false
      end
      if book.save

SELECT "books".* FROM "books" WHERE "books"."isShared" = ?  [["isShared", "t"]]
SELECT "books".* FROM "books" WHERE "books"."title" = ? AND "books"."isShared" = ?  [["title", " Skip graphs"], ["isShared", "t"]]
SELECT "books".* FROM "books"
SELECT "books".* FROM "books" WHERE "books"."author" = ? AND "books"."isShared" = ?  [["author", " Skip graphs"], ["isShared", "t"]]
SELECT "books".* FROM "books" WHERE "books"."isbn" = ? AND "books"."isShared" = ?  [["isbn", " Skip graphs"], ["isShared", "t"]]
---
  def search
    if params[:search_term] == ""
      books = Book.where(:isShared => true)
      render json: books, status: 200
    else
      books = Book.where(:title => params[:search_term], :isShared => true)
      if !(books.blank?)
        puts "found books by title"
        puts books
        render json: books, status: 200
      else
        books = Book.where(:author => params[:search_term], :isShared => true)
        if !(books.blank?)
          puts "found books by author"
          puts books
          render json: books, status: 200
        else
          books = Book.where(:isbn => params[:search_term], :isShared => true)